Repository: AddstarMC/uSkyBlock
Catalog: src/main/po/*.po
Languages: ru

source: §4Requirements will reset in {0} days.
ru: §4Требования будут сброшены через {0} д.

source: §4Requirements will reset in {0} hours.
ru: §4Требования будут сброшены через {0} ч.

source: §4Requirements will reset in {0} minutes.
ru: §4Требования будут сброшены через {0} мин.

source: §eThis challenge requires the following:
ru: §eЭто задание требует:

source: §6Item Reward: §a
ru: §6Награда предметами: §a

source: §6Currency Reward: §a{0}
ru: §6Награда деньгами: §a{0}

source: §6Exp Reward: §a{0}
ru: §6Награда опыт: §a{0}

source: §dTotal times completed: §f{0}
ru: §dПолное время выполнения: §f{0}

source: §4No challenge named {0} found
ru: §4Не найдено задание {0}

source: §4The {0} challenge is not repeatable!
ru: §4Задание {0} нельзя повторить!

source: §4You don't have enough of the required item(s)!
ru: §4У вас недостаточно требуемых предметов!

source: §4You must be on your island to do that!
ru: §4Вам надо быть на острове, чтобы сделать это!

source: §4You must be standing within {0} blocks of all required items.
ru: §4Должно быть {0} блоков из всех требуемых предметов.

source: §4Your island must be level {0} to complete this challenge!
ru: §4Для завершения задания остров должен иметь уровень {0}!

source: §4Unknown type of challenge: {0}
ru: §4Неизвестный тип задания: {0}

source: §eStill the following blocks short: {0}
ru: §eПо прежнему мало блоков: {0}

source: §eStill the following entities short: {0}
ru: §eПо прежнему мало существ: {0}

source: §eYou are the following items short:{0}
ru: §eУ вас мало предметов:{0}

source: §aYou have completed the {0} challenge!
ru: §aВы выполнили задание {0} !

source: {0} has completed the {1} challenge!
ru: {0} выполнил задание {1}!

source: §eItem reward(s): §f{0}
ru: §eНаграда: §f{0}

source: §eExp reward: §f{0,number,#.#}
ru: §eНаграда опыт: §f{0,number,#.#}

source: §eCurrency reward: §f{0,number,###.##} {1} §a ({2,number,##.##})%
ru: §eНаграда деньгами: §f{0,number,###.##} {1} §a ({2,number,##.##})%

source: §eYour inventory is §4full§e. Items dropped on the ground.
ru: §eВаш инвентарь §4переполнен§e. Предметы брошены на землю.

source: §e§lClick to complete this challenge.
ru: §e§lНажмите для завершения задания.

source: §4§lYou can't repeat this challenge.
ru: §4§lВы не можете повторить задание.

source: Rank: {0}
ru: Звание: {0}

source: §fComplete most challenges in
ru: §fЗавершено большинство заданий в

source: §fthis rank to unlock the next rank.
ru: §fэто звание разблокировало следующее.

source: §eClick here to show previous page
ru: §eНажмите для просмотра предыдущей страницы

source: §eClick here to show next page
ru: §eНажмите для просмотра следующей страницы

source: §4§lLocked Challenge
ru: §4§lЗадание заблокировано

source: §eChallenges has been disabled. Contact an administrator.
ru: §eЗадания выключены. Свяжитесь с администратором.

source: §4You don't have access to this command!
ru: §4У вас недостаточно прав для выполнения этой команды!

source: §4You can only submit challenges in the skyblock world!
ru: §4Отправить задания возможно только в мире skyblock!

source: §4You can only submit challenges when you have an island!
ru: §4Отправить задание можно только если у вас есть остров!

source: §eUse /c <name> to view information about a challenge.
ru: §eВведите /c <name> для просмотра информации по заданию.

source: §eUse /c complete <name> to attempt to complete that challenge.
ru: §eВведите /c complete <name> для подтверждения выполения задания.

source: §eChallenges will have different colors depending on if they are:
ru: §eЗадания будут разноцветными, если они:

source: Incomplete
ru: Не завершено

source: Completed (not repeatable)
ru: Завершено (не повторяемо)

source: Completed(repeatable)
ru: Завершено(повторяемо)

source: §4You will lose all required items when you complete this challenge!
ru: §4У вас заберут все необходимые предметы, если вы завершите задание!

source: §4All required items must be placed on your island, within {0} blocks of you.
ru: §4Все требуемые предметы должны быть размещены на вашем острове в {0} блоках.

source: §eRank:
ru: §eЗвание:

source: §4This Challenge is not repeatable!
ru: §4Это задание нельзя повторить!

source: §eTo complete this challenge, use §f/c c {0}
ru: §eДля завершения задания введите §f/c c {0}

source: §4Invalid challenge name! Use /c help for more information
ru: §4Неверное название задания! Введите /c help для подробной информации

source: Complete {0} more {1} challenges
ru: Выполнено {0} более {1} заданий

source: §7Complete {0}
ru: §7Выполнено {0}

source: to unlock this rank
ru: для разблокировки звания

source: §ePlayer {0} has no island!
ru: §eИгрок {0} не имеет острова!

source: §eInvalid player {0} supplied.
ru: §eНекорректный игрок {0}.

source: Manage challenges for a player
ru: Управлять заданиями для игрока

source: §4Challenge has already been completed
ru: §4Задание уже выполнено

source: §echallenge: {0} has been completed for {1}
ru: §eзадание: {0} выполнено игроком {1}

source: resets the challenge for the player
ru: сбросить задание для игрока

source: §4Challenge has never been completed
ru: §4Задание никогда не будет выполнено

source: §echallenge: {0} has been reset for {1}
ru: §eзадание: {0} сброшено для игрока {1}

source: resets all challenges for the player
ru: сбросить все задания для игрока

source: §e{0} has had all challenges reset.
ru: §eУ игрока {0} сброшены все задания.

source: §4No challenge named {0} was found!
ru: §4Задание с названием {0} не найдено!

source: §4No player named {0} was found!
ru: §4Игрок с именем {0} не найден!

source: manage islands
ru: управление островом

source: protects the island
ru: защита острова

source: delete the island (removes the blocks)
ru: удалить остров (убрать блоки)

source: §9Deleted abandoned island at your current location.
ru: §9Удален заброшенный остров по вашим координатам.

source: §4Island at this location has members! §eUse §9/usb island delete <name>§e to delete it.
ru: §4Остров в этом месте имеет участников! §eВведите §9/usb island delete <name>§e для его удаления.

source: removes the player from the island
ru: удаление игрока с острова

source: print out info about the island
ru: вывод информации об острове

source: protects all islands (time consuming)
ru: защита всех островов (затратно по времени)

source: sets the biome of the island
ru: установка биома для острова

source: §4That player has no island.
ru: §4Этот игрок не имеет острова.

source: §4No valid island at your location
ru: §4В этом месте нет подходящих островов

source: purges the island
ru: очистка острова

source: §4Error! §9No valid island found for purging.
ru: §4Ошибка! §9Нет подходящих островов для очистки.

source: §cPURGE: §9Purged island at {0}
ru: §cОЧИСТКА: §9Очищен остров {0}

source: toggles the islands ignore status
ru: переключения статуса игнорирования

source: §cSet {0}s island to be ignored on top-ten and purge.
ru: §cПереключение острова {0} в игнорирование для ТОП10 и очистки.

source: §cRemoved ignore-flag of {0}s island, it will now show up on top-ten and purge.
ru: §cОтмена игнорирования острова {0}, теперь он показывается в ТОП10 и очистке.

source: §4No valid player-name supplied.
ru: §4Имя игрока недействительно.

source: Removing {0} from island
ru: Удаление {0} с острова

source: §eChanged biome of {0}s island to {1}.
ru: §eИзменен биом острова {0} на {1}.

source: §eChanged biome of {0}s island to OCEAN.
ru: §eИзменен биом острова {0} на Океан.

source: §aYou may need to go to spawn, or relog, to see the changes.
ru: §aВы должны отправится на спавн или перезайти, чтобы увидеть изменения.

source: §e{0} has had their biome changed to {1}.
ru: §e{0} изменил биом на {1}.

source: §e{0} has had their biome changed to OCEAN.
ru: §e{0} изменил биом на Океан.

source: §4Sorry!§e A protect-all is already running. Let it complete first.
ru: §4Извините!§e Защита всего уже включена. Завершите сначала.

source: §eStarting a protect-all task. It will take a while.
ru: §eЗапуск защиты всего. Это займет немного времени.

source: §eRemoving {0}'s island.
ru: §eУдаление острова {0}.

source: Error: That player does not have an island!
ru: Ошибка: Игрок не имеет острова

source: §e{0}s island at {1} has been protected
ru: §eОстров {0} в {1} защищен

source: §4{0}s island at {1} was already protected
ru: §4Остров {0} в {1} уже был защищен

source: controls the currently running async tasks
ru: контроль запущенных параллельных задач

source: lists currently running tasks
ru: список запущенных задач

source: §cNo running tasks
ru: §cНет запущенных задач

source: cancels the task with the given number.
ru: отмена задачи по указанному номеру

source: §4Could not cancel
ru: §4Отмена невозможна

source: §4A valid number must be supplied as task-id.
ru: §4В номере задачи должно указываться корректное число.

source: §4No tasks detected.§e Try §b/usb async list§e first.
ru: §4Задачи не обнаружены.§e Попробуйте §b/usb async list§e сначала.

source: §4A number between 1 and
ru: §4Номер между 1 и

source: The player is not currently online
ru: Игрок сейчас оффлайн

source: Invalid command supplied, only restart and biome supported!
ru: Неверная команда, только перезапуск и биом поддерживаются

source: §eThe player is not currently online
ru: §eИгрок в оффлайн

source: control debugging
ru: управление отладкой

source: set debug-level
ru: установка уровня отладки

source: toggle debug-logging
ru: переключение журнала отладки

source: §4Logging wasn't active, so you can't disable it!
ru: §4Ведение журнал отключено, вы не можете отключить его!

source: flush current content of the logger to file.
ru: сбросить текущее содержание журнала в файл

source: §eLog-file has been flushed.
ru: §eФайл журнала обновлен.

source: §4Logging is not enabled, use §d/usb debug enable
ru: §4Ведение журнала не включено, введите §d/usb debug enable

source: §4Invalid argument, try INFO, FINE, FINER, FINEST
ru: §4Некорректные аргументы, попробуйте INFO, FINE, FINER, FINEST

source: §eLogging disabled!
ru: §eВедение журнала отключено!

source: tries to fix the the area of flatland.
ru: попытка исправить территорию на равнине

source: §4No valid island found
ru: §4Подходящего острова не найдено

source: §4No flatland detected at {0}'s island!
ru: §4Равнина не найдена на острове {0}!

source: manually update the top 10 list
ru: ручное обновление списка ТОП 10

source: §eGenerating the Top Ten list
ru: §eГенерирование списка ТОП 10

source: §eFinished generation of the Top Ten list
ru: §eгенерация списка ТОП 10 завершена

source: teleport to another players island
ru: телепортация на остров другого игрока

source: §4Only supported for players
ru: §4Поддерживается только для игроков

source: §aTeleporting to {0}s island.
ru: §aТелепортация на остров {0}.

source: §4That player does not have an island!
ru: §4Этот игрок не имеет острова!

source: imports players and islands from other formats
ru: импортирование игроков и островов в другие форматы

source: transfer leadership to another player
ru: сделать хозяином другого игрока

source: §4Player {0} has no island to transfer!
ru: §4Игрок {0} не имеет острова для передачи!

source: §ePlayer §d{0}§e already has an island.§eUse §d/usb island remove <name>§e to remove him first.
ru: §eИгрок §d{0}§e уже имеет остров.§eСначала введите §d/usb island remove <name>§e для его удаления.

source: §bLeadership transferred by {0}§b to {1}
ru: §bХозяин изменен у {0}§b на {1}

source: manage orphans
ru: управления сиротами

source: count orphans
ru: количество сирот

source: §e{0} old island locations will be used before new ones.
ru: §eСтарое место острова {0} будет использоваться, пока не появится новое.

source: clear orphans
ru: очистить сирот

source: §eClearing all old (empty) island locations.
ru: §eОчистка всех старых (пустых) островов.

source: list orphans
ru: список сирот

source: §eNo orphans currently registered.
ru: §eСироты не зарегистрированы.

source: §eOrphans: {0}
ru: §eСироты: {0}

source: purges all abandoned islands
ru: очистка всех заброшенных островов

source: §4A purge is already running, please wait for it to finish!
ru: §4Очистка уже запущена, дождитесь завершения!

source: §4You must provide the age in days to purge!
ru: §4Вам нужно указать возраст в днях для очистки!

source: §eFinding all islands that has been abandoned for more than {0} days.
ru: §eПоиск всех островов, которые заброшены более {0} дней.

source: set a player's island to your location
ru: установка острова игрока в вашей позиции

source: §aSet {0}'s island to the bedrock nearest you.
ru: §aУстановить остров игрока {0} на бедрок около себя.

source: §4Bedrock not found: unable to set the island!
ru: §4Бедрок не найден: нельзя установить остров!

source: reload configuration from file.
ru: перезагрузка конфигурации из файла

source: §eConfiguration reloaded from file.
ru: §eКонфигурация перезагружена из файла.

source: §4PURGE:§9 Finished purging abandoned islands.
ru: §4ОЧИСТКА:§9 Очистка заброшенных островов завершена.

source: §4PURGE:§9 Scanning done, found {0} candidates for purgatory.
ru: §4ОЧИСТКА:§9 Сканирование завершено, найдено {0} кандидатов на очистку.

source: §cPURGE:§9 Purged {0}/{1} {2,##,number}
ru: §cОЧИСТКА:§9 Очищено {0}/{1} {2,##,number}

source: displays version information
ru: показать информацию о версии

source: various WorldGuard utilities
ru: различные утилиты WorldGuard

source: refreshes the chunks around the player
ru: обновление чанков вокруг игрока

source: §eResending chunks to the client
ru: §eСброс чанков в клиенте

source: load the region chunks
ru: загрузка чанков региона

source: §eLoading chunks at {0}
ru: §eЗагрузка чанков у {0}

source: §eUnloading chunks at {0}
ru: §eВыгрузка чанков у {0}

source: show player-information
ru: показать информацию по игроку

source: §7Usage: {0}
ru: §7Введите: {0}

source: §4Your island is full, or you have too many pending invites. You can't invite anyone else.
ru: §4Ваш остров заполнен или вы больше не можете приглашать новых участников.

source: §4That player is already leader on another island.
ru: §4Этот игрок уже владеет другим островом.

source: §e{0}§e tried to invite you, but you are already in a party.
ru: §e{0}§e пытался пригласить вас, но вы уже приглашены.

source: {0}§e has invited you to join their island!
ru: {0}§e пригласил вас присоединится к острову!

source: §f/island [accept/reject]§e to accept or reject the invite.
ru: §f/island [accept/reject]§e для согласия или отказа на предложения присоединится.

source: §4WARNING: You will lose your current island if you accept!
ru: §4ВНИМАНИЕ: Вы потеряете свой текущий остров, если согласитесь присоединиться!

source: {0}§e has rejected the invitation.
ru: {0}§e отклонил предложение.

source: §4You can't use that command right now. Leave your current party first.
ru: §4Вы не можете использовать эту команду сейчас. Откажитесь от участия на другом острове сначала.

source: §aYou have joined an island! Use /island party to see the other members.
ru: §aВы присоединились к острову! Введите /island party для просмотра других участников.

source: §b{0}§d has joined your island group.
ru: §b{0}§d присоединился к вашему острову.

source: §eInvitation for {0}§e has timedout or been cancelled.
ru: §eПриглашение для {0}§e было просрочено или отменено.

source: §eInvitation for {0}'s island has timedout or been cancelled.
ru: §eПриглашение на остров игрока {0} было просрочено или отменено.

source: accept/reject an invitation.
ru: принять/отклонить приглашение.

source: §eYou have rejected the invitation to join an island.
ru: §eВы отклонили предложение о присоединении к острову

source: §4You haven't been invited.
ru: §4Вы не были приглашены.

source: §eYou have accepted the invitation to join an island.
ru: §eВы приняли приглашения о присоединении к острову.

source: ban/unban a player from your island.
ru: блокировать/разблокировать игрока на вашем острове.

source: §eThe following players are banned from warping to your island:
ru: §eУказанным игрокам запрещено появляться на вашем острове:

source: §eTo ban/unban from your island, use /island ban <player>
ru: §eДля блокировки/разблокировки игроков на вашем острове используйте /island ban <player>

source: §4You can't ban members. Remove them first!
ru: §4Вы не можете заблокировать участника. Сначала исключите его!

source: §4You do not have permission to kick/ban players.
ru: §4у вас недостаточно прав, чтобы выбрасывать или блокировать игроков.

source: §eYou have banned §4{0}§e from warping to your island.
ru: §eВы запретили игроку §4{0}§e посещать ваш остров.

source: §eYou have unbanned §a{0}§e from warping to your island.
ru: §eВы разрешили игроку §a{0}§e посещать ваш остров.

source: change the biome of the island
ru: изменение биома острова

source: §cYou do not have permission to change the biome of your current island.
ru: §cУ вас недостаточно прав для изменения биома вашего текущего острова.

source: §eYou can change your biome again in {0,number,#} minutes.
ru: §eВы сможете изменить биом снова через {0,number,#} мин.

source: §aYou have changed your island''s biome to {0}
ru: §aВы изменили биом острова на {0}

source: {0} changed the island biome to {1}
ru: {0} изменил биом острова на {1}

source: §cYou do not have permission to change your biome to that type.
ru: §cУ вас недостаточно прав для изменения биома острова на указанный.

source: §cYou have misspelled the biome name.
ru: §cНеверно указано название биома.

source: §eYou must be on your island to change the biome!
ru: §eДля изменения биома вы должны быть на своем острове!

source: §4You do not have permission to change the biome of this island!
ru: §4У вас недостаточно прав для изменения биома острова!

source: create an island
ru: создание острова

source: §cYour island is in the process of generating, you cannot create now.
ru: §cВаш остров в процессе создания. Вы не можете создать сейчас.

source: §4Island found!§e You already have an island. If you want a fresh island, type§b /is restart§e to get one
ru: §4Остров найден!§e Вы уже имеете остров. Если хотите очистить его, введите§b /is restart

source: §4Island found!§e You are already a member of an island. To start your own, first§b /is leave
ru: §4Остров найден!§e Вы уже участник этого острова. Чтобы создать свой, сначала введите §b /is leave

source: §eYou can create a new island in {0,number,#} seconds.
ru: §eВы сможете создать новый остров через {0,number,#} сек.

source: teleport to the island home
ru: телепортация на остров

source: §cYour island is in the process of generating, you cannot teleport home right now.
ru: §cВаш остров в процессе создания, вы не можете пока на него телепортироваться.

source: check your or anothers island info
ru: проверить информацию вашего или другого острова

source: §4Island level has been disabled, contact an administrator.
ru: §4Уровень острова отключен, свяжитесь с администратором.

source: §eYou must be on your island to use this command.
ru: §eДля выполнения этой команды нужно быть на своем острове.

source: §4You do not have an island!
ru: §4У вас нет острова!

source: §4You do not have access to that command!
ru: §4У вас нет доступа к этой команде!

source: §4That player is invalid or does not have an island!
ru: §4Неверно указан игрок или у него нет острова!

source: §eBlocks on {0}s Island (page {1,number} of {2,number}):
ru: §eБлоки на острове игрока {0} (страница {1,number} из {2,number}):

source: invite a player to your island
ru: пригласить игрока на свой остров

source: §eUse§f /island invite <playername>§e to invite a player to your island.
ru: §eВведите§f /island invite <playername>§e для отправки приглашения игроку на свой остров.

source: §4Only the island's owner can invite!
ru: §4Только хозяин острова может приглашать!

source: §aYou can invite {0} more players.
ru: §aВы можете пригласить еще {0} игроков.

source: §4You can't invite any more players.
ru: §4Вы больше не можете приглашать игроков.

source: §4You do not have permission to invite others to this island!
ru: §4У вас недостаточно прав для приглашения других на остров!

source: §4That player is offline or doesn't exist.
ru: §4Этот игрок оффлайн или не существует.

source: §4You can't invite yourself!
ru: §4Вы не можете пригласить себя!

source: §4That player is the leader of your island!
ru: §4Этот игрок - лидер вашего острова!

source: {0}§d invited {1}
ru: {0}§d приглашен игроком {1}

source: remove a member from your island.
ru: удаление участников острова.

source: §4You do not have permission to kick others from this island!
ru: §4У вас недостаточно прав, чтобы выбрасывать игроков с этого острова!

source: §4You can't remove the leader from the Island!
ru: §4Вы не можете убрать лидера острова!

source: §4Stop kickin' yourself!
ru: §4Прекратите себя выбрасывать!

source: §4{0} has removed you from their island!
ru: §4{0} удалил вас со своего острова!

source: §4{0} has been removed from the island.
ru: §4{0} удален с острова.

source: §4{0} has been kicked from the island.
ru: §4{0} выброшен с острова.

source: §4That player is not part of your island group, and not on your island!
ru: §4Этот игрок не участник вашего острова и не на вашем острове!

source: leave your party
ru: выход из группы

source: §4You can't leave your island if you are the only person. Try using /island restart if you want a new one!
ru: §4Вы не можете покинуть остров, если вы единственный участник. Введите /island restart, чтобы получить новый остров!

source: §eYou own this island, use /island remove <player> instead.
ru: §eВы владелец острова, введите /island remove <player>.

source: §eYou have left the island and returned to the player spawn.
ru: §eВы покинули остров и возвращены на спавн.

source: §4{0} has left your island!
ru: §4{0} покинул ваш остров!

source: §4You must be in the skyblock world to leave your party!
ru: §4Чтобы отказаться от членства на острове нужно быть в мире skyblock!

source: check your or anothers island level
ru: проверка уровня своего и чужого острова

source: §eInformation about {0}'s Island:
ru: §eИнформация об острове {0}:

source: §aIsland level is {0,number,###.##}
ru: §aУровень острова {0,number,###.##}

source: §9Rank is {0}
ru: §9Ранг {0}

source: lock your island to non-party members.
ru: блокировать остров от посторонних игроков.

source: §4You do not have permission to lock your island!
ru: §4У вас недостаточно прав для блокировки вашего острова!

source: §4You do not have permission to unlock your island!
ru: §4У вас недостаточно прав для разблокировки вашего острова!

source: display log
ru: показать журнал

source: transfer leadership to another member
ru: передать лидерство другому игроку

source: §4You can only transfer ownership to party-members!
ru: §4Владение островом можно передать только участнику острова!

source: {0}§e is already leader of your island!
ru: {0}§e уже владелец этого острова!

source: §4Only leader can transfer leadership!
ru: §4Только хозяин может передать управление!

source: {0} tried to take over the island!
ru: {0} пытался захватить остров!

source: show party information
ru: информация об участниках острова

source: shows information about your party
ru: показать информацию об участниках острова

source: show pending invites
ru: ожидающие приглашения

source: §eNo pending invites
ru: §eНет ожидающих приглашения

source: withdraw an invite
ru: вывести приглашение

source: §4You don't have permissions to uninvite players.
ru: §4У вас недостаточно прав для отмены приглашений.

source: §4This command can only be executed by a player
ru: §4Это команда может быть запущена только игроком

source: §4No Island. §eUse §b/is create§e to get one
ru: §4Нет острова. §eВведите §b/is create§e для создания острова

source: delete your island and start a new one.
ru: удаление вашего острова и создание нового
