Repository: AddstarMC/uSkyBlock
Catalog: src/main/po/*.po
Languages: ru

source: §4Only the owner may restart this island. Leave this island in order to start your own (/island leave).
ru: §4Только владелец может перезапустить остров. Покиньте этот остров, чтобы создать свой (/island leave).

source: §eYou must remove all players from your island before you can restart it (/island kick <player>). See a list of players currently part of your island using /island party.
ru: §eВы должны выбросить всех участников с острова, чтобы перезапустить его (/island kick <player>). Список участников острова /island party.

source: §cYou can restart your island in {0} seconds.
ru: §cВы можете перезапустить свой остров через {0} сек.

source: §cYour island is in the process of generating, you cannot restart now.
ru: §cВаш остров в процессе создания. Вы не можете перезапустить его.

source: §eNOTE: Your entire island and all your belongings will be RESET!
ru: §eВНИМАНИЕ: Ваш остров и все ваши вещи будут сброшены!

source: set the island-home
ru: установка точки дома

source: set your island's warp location
ru: установка точки перемещения

source: §cYou do not have permission to set your island's warp point!
ru: §cУ вас недостаточно прав для установки точки перемещения на острове!

source: §cYou need to be on your own island to set the warp!
ru: §cВы должны быть владельцем острова, чтобы установить точку перемещения!

source: §b{0}§d changed the island warp location.
ru: §b{0}§d изменил точку перемещения на острове.

source: teleports you to the skyblock spawn
ru: телепортация на спавн

source: enable/disable warping to your island.
ru: вкл/выкл точки перемещения на ваш остров

source: §4Your island is locked. You must unlock it before enabling your warp.
ru: §4Ваш остров закрыт. Вы должны открыть его перед включением точек перемещения.

source: §cYou do not have permission to enable/disable your island's warp!
ru: §cУ вас недостаточно прав для вкл/выкл точек перемещения на острове!

source: display the top10 of islands
ru: показать ТОП 10 островов

source: trust/untrust a player to help on your island.
ru: доверять/не доверять игроку на вашем острове

source: §eThe following players are trusted on your island:
ru: §eЭтим игрокам доверяют на вашем острове:

source: §eThe following leaders trusts you:
ru: §eЭти хозяева доверяют вам:

source: §eTo trust/untrust from your island, use /island trust <player>
ru: §eДля доверия/не доверия на острове введите /island trust <player>

source: §4Members are already trusted!
ru: §4Игрок уже в доверенных!

source: §4Unknown player {0}
ru: §4Неизвестный игрок {0}

source: §eYou have trusted §4{0}§e on your island.
ru: §eВы доверяете §4{0}§e на своем острове.

source: §eYou are now trusted on §4{0}'s §eisland.
ru: §eВам не доверяют на острове §4{0}.

source: §eYou have revoked your trust in §a{0}§e on your island.
ru: §eВы больше не доверяете §a{0}§e на своем острове.

source: §eYou are no longer trusted on §4{0}'s §eisland.
ru: §eВам больше не доверяют на острове §4{0}.

source: warp to another player's island
ru: перемещение на остров другого игрока

source: §aYour incoming warp is active, players may warp to your island.
ru: §aВаша точка перемещения активна, игроки могут перемещаться к вам на остров.

source: §4Your incoming warp is inactive, players may not warp to your island.
ru: §4Ваша точка перемещения отключена, игроки не могут перемещаться к вам на остров.

source: §fSet incoming warp to your current location using §e/island setwarp
ru: §fУстановите точку перемещения в этом месте командой §e/island setwarp

source: §fToggle your warp on/off using §e/island togglewarp
ru: §fПереключение вкл/выкл точки перемещения командой §e/island togglewarp

source: §4You do not have permission to create a warp on your island!
ru: §4У вас недостаточно прав для создания точки перемещения на ваш остров!

source: §fWarp to another island using §e/island warp <player>
ru: §fПереместиться на другой остров можно командой §e/island warp <player>

source: §4You do not have permission to warp to other islands!
ru: §4У вас недостаточно прав для перемещения на другой остров!

source: §cYour island is in the process of generating, you cannot warp to other players islands right now.
ru: §cВаш остров в процессе создания. Вы не можете сейчас переместиться на острова других игроков.

source: §4That player does not exist!
ru: §4Игрок не существует!

source: §4That player does not have an active warp.
ru: §4Игрок не имеет активных точек перемещения.

source: §cThat players island is in the process of generating, you cannot warp to it right now.
ru: §cОстров этого игрока в процессе создания. Вы не можете переместиться сейчас.

source: §cWARNING: §9{0}§e is warping to your island!
ru: §cВНИМАНИЕ: §9{0}§e переместился на ваш остров!

source: §4That player has forbidden you from warping to their island.
ru: §4Этот игрок запретил вам перемещаться на свой остров.

source: But you are ALLLLLLL ALOOOOONE!
ru: Но вы в полном одиночестве!

source: But you are Yelling in the wind!
ru: Но вы кричите ветру!

source: But your fantasy friends are gone!
ru: Но ваши придуманные друзья ушли!

source: But you are Talking to your self!
ru: Но вы разговариваете сами с собой!

source: §cSorry! {0}
ru: §cИзвините! {0}

source: general island command
ru: основные команды острова

source: talk to players on your island
ru: говорить с игроками на своем острове

source: talk to your island party
ru: говорить с участниками вашего острова

source: §eYou can not use another islands portals! Shame on you - cheater!
ru: §eВы не можете использовать портал на другие острова! Вы - читер!

source: §eTrading isn't allowed on other islands. Go home - cheater!
ru: §eТорговля не разрешена на других островах. Идите домой - читер!

source: §eChanging your obsidian back into lava. Be careful!
ru: §eИзменение вашего обсидиана обратно в лаву. Осторожнее!

source: §4It's a bad idea to replace your lava!
ru: §4Плохая идея переместить вашу лаву!

source: §4That player has forbidden you from teleporting to their island.
ru: §4Этот игрок запретил вам телепортироваться на свой остров.

source: §cYou have reached your spawn-limit for your island.
ru: §cВы достигли предела спавнов на вашем острове.

source: §eYou can only use spawn-eggs on your own island.
ru: §eВы можете использовать спавн-яйца только на своем острове.

source: §9{0}§7 timed out
ru: §9{0}§7 время вышло

source: §eDoing §9{0}§e is §cRISKY§e. Repeat the command within §a{1}§e seconds to accept!
ru: §eДелать §9{0}§e §cРИСКОВАННО§e. Повторите команду через §a{1}§e сек. для подтверждения!

source: §d** You are entering §b{0}'s §disland.
ru: §d** Вы вошли на остров игрока §b{0}.

source: §d** You are leaving §b{0}'s §disland.
ru: §d** Вы покинули остров игрока §b{0}.

source: §eYour island is now locked. Only your party members may enter.
ru: §eВаш остров теперь закрыт. Только участники вашего острова могут войти.

source: §4You must be the party leader to lock your island!
ru: §4Вы должны быть хозяином острова, чтобы закрыть его!

source: §eYour island is unlocked and anyone may enter, however only you and your party members may build or remove blocks.
ru: §eВаш остров открыт и кто угодно может зайти, но только вашим участникам разрешено строить.

source: §4You must be the party leader to unlock your island!
ru: §4Вы должны быть хозяином острова, чтобы открыть его!

source: §4** You are entering a protected - but abandoned - island area.
ru: §4** Вы входите на защищенный, но заброшенный остров.

source: §4** You are leaving an abandoned island.
ru: §4** Вы покидаете заброшенный остров.

source: §4No importer named §e{0}§4 found
ru: §4Не найден импортер с именем §e{0}

source: §eConverted
ru: §eКонвертировано

source: §4Since your island is locked, your incoming warp has been deactivated.
ru: §4С момента закрытия острова точка перемещения деактивирована.

source: §b{0}§d deactivated the island warp.
ru: §b{0}§d деактивировал точку перемещения на острове.

source: §b{0}§d has been removed from the island group.
ru: §b{0}§d удален из участников острова.

source: §cThe island you are on is being deleted! Sending you to spawn.
ru: §cОстров, на котором вы находитесь - удален! Телепортация на спавн.

source: §eWALL OF FAME (page {0} of {1}):
ru: §eWALL OF FAME (страница {0} из {1}):

source: §4Top ten list is empty! (perhaps the generation failed?)
ru: §4Список ТОП 10 пуст! (возможно ошибка генерации?)

source: §eYour rank is: §f{0}
ru: §eВаш ранг: §f{0}

source: Challenge Menu
ru: Меню заданий

source: change the islands's biome.
ru: изменять биом острова

source: toggle the island's lock.
ru: переключать блокировку острова.

source: set the island's warp.
ru: устанавливать точку перемещения.

source: set the island's warp, which allows non-group members to teleport to the island
ru: Установка точки перемещения, которая позволит приходить игрокам - не участникам острова

source: toggle the island's warp.
ru: переключать точку перемещения.

source: toggle the island's warp, allowing them to turn it on or off at anytime. but not set the location.
ru: переключение точки перемещения возможно выключать и включать в любое время, но не устанавливать место перемещения.

source: invite others to the island.
ru: приглашать других на остров

source: invite other players to the island if there is enough room for more members
ru: приглашать других игроков на остров, если хватает места для новых участников

source: kick others from the island.
ru: выкидывать других с острова

source: kick other players from the island, but they are unable to kick the island leader.
ru: выкидывать других игроков с острова, но выкинуть хозяина острова невозможно.

source: {0} <Permissions>
ru: {0} <Права>

source: §hPlayer Permissions
ru: §hПрава игрока

source: §eClick here to return to §eyour island group's info.
ru: §eНажмите для возврата §eк информации о группе острова.

source: §eHover over an icon to view §ea permission. Change the §epermission by clicking it.
ru: §eНаведите на иконку для просмотра §eправ. Изменить их §eможно по клику.

source: §fThis player §acan
ru: §fИгрок §aможет

source: Click here to remove this permission.
ru: Нажмите для запрещения

source: §fThis player §ccannot
ru: §fИгрок §cне может

source: Click here to grant this permission.
ru: Нажмите для разрешения

source: Island Group Members
ru: Участники группы островов

source: Group Members: §2{0}§7/§e{1}
ru: Участники группыs: §2{0}§7/§e{1}

source: §aMore players can be invited to this island.
ru: §aМожно пригласить еще участников.

source: §cThis island is full.
ru: §cОстров заполнен.

source: §eHover over a player's icon to §eview their permissions. The §eleader can change permissions §eby clicking a player's icon.
ru: §eНаведите на иконку игрока §eдля просмотра его прав. §eВладелец острова может изменять §eих по клику на иконке игрока.

source: Leader
ru: Хозяин

source: Member
ru: Участник

source: Can {0}
ru: Может {0}

source: Cannot {0}
ru: Не может {0}

source: §e<Click to change this player's permissions>
ru: §e<нажмите для изменения прав игрока>

source: Island Log
ru: Журнал острова

source: §eClick here to return to §ethe main island screen.
ru: §eНажмите для возврата §eв главное меню острова.

source: §e§lIsland Log
ru: §e§lЖурнал острова

source: Island Biome
ru: Биом острова

source: Ocean
ru: Океан

source: The ocean biome is the basic starting biome for all islands. passive mobs like animals will not spawn. Hostile mobs will spawn normally.
ru: Биом океана - простой, стандартный биом для всех островов. Мирные мобы не появляются. Монстры появляются нормально.

source: Forest
ru: Лес

source: The forest biome will allow your island to spawn passive. mobs like animals (including wolves). Hostile mobs will spawn normally.
ru: Биом леса позволяет появляться на вашем острове мирным мобам (включая волков). Монстры появляются нормально.

source: Desert
ru: Пустыня

source: The desert biome makes it so that there is no rain or snow on your island. Passive mobs won't spawn. Hostile mobs will spawn normally.
ru: В биоме пустыни сделано так, что не будет ни дождя ни снега на острове. Мирные мобы не появляются. Монстры появляются нормально.

source: Jungle
ru: Джунгли

source: The jungle biome is bright and colorful. Passive mobs (including ocelots) will spawn. Hostile mobs will spawn normally.
ru: Биом джунглей яркий и цветной. Мирные мобы (включая оцелота) будут появляться. Монстры будут появляться нормально.

source: Swampland
ru: Болото

source: The swamp biome is dark and dull. Passive mobs will spawn normally and slimes have a small chance to spawn at night depending on the moon phase.
ru: Биом болота и темный и скучный. Мирные мобы появляются нормально и слизняки имеют маленький шанс появится ночью в лунной фазе.

source: Taiga
ru: Тайга

source: The taiga biome has snow instead of rain. Passive mobs will spawn normally (including wolves) and hostile mobs will spawn.
ru: Биом тайги снежный, дождя нет. Мирные мобы появляются нормально (включая волков) и монстры тоже появляются.

source: Mushroom
ru: Грибы

source: The mushroom biome is bright and colorful. Mooshrooms are the only mobs that will spawn. No other passive or hostile mobs will spawn.
ru: Грибной биом яркий и цветной. Мобы появляются толко вылупленные из яиц.

source: Hell
ru: Нижний мир

source: The hell biome looks dark and dead. Some mobs from the nether will spawn in this biome (excluding ghasts and blazes).
ru: Нижний мир выглядет темным и страшным. Некоторые мобы нижнего мира будут появляться в этом биоме (исключая гастов и ифритов).

source: Sky
ru: Космос

source: The sky biome gives your island a special dark sky. Only endermen will spawn in this biome.
ru: Космос придаст вашему острову темное небо. Только эндермены будут здесь появляться.

source: Plains
ru: Равнина

source: The plains biome has rain instead of snow. Passive mobs will spawn normally (including horses) and hostile mobs will spawn.
ru: Равнинный биом - дождливый. Снега нет. Мирные мобы будут появляться нормально (включая лошадей) и монстры будут появляться.

source: Extreme Hills
ru: Высокие горы

source: The extreme hills biome. Passive mobs will spawn normally and hostile mobs will spawn.
ru: Высокогорье. Мирные мобы появляются нормально, как и монстры.

source: Flower Forest
ru: Цветочный лес

source: The flower forest biome. Passive mobs will spawn normally and hostile mobs will spawn.
ru: Биом цветочного леса. Мирные мобы появляются нормально, как и монстры.

source: Biome: {0}
ru: Биом: {0}

source: §2§lThis is your current biome.
ru: §2§lЭто ваш текущий биом.

source: §e§lClick to change to this biome.
ru: §e§lНажмите, чтобы изменить биом.

source: You cannot use this biome.
ru: Вы не можете использовать этот биом.

source: Island Menu
ru: Меню острова

source: Island Create Menu
ru: Меню создания острова

source: §a§lStart an Island
ru: §a§lСоздать остров

source: Start your skyblock journey by starting your own island. Complete challenges to earn items and skybucks to help expand your skyblock. You can invite others to join in building your island empire! §e§lClick here to start!
ru: Начните свое островное приключение с создания своего острова. Выполняйте задания, чтобы получить предметы и деньги. Они помогут расширить ваш остров. Вы можете приглашать других присоединиться к строительству вашей островной империи! §e§lНажмите для старта!

source: §a§lJoin an Island
ru: §a§lПрисоединиться к острову

source: Want to join another player's island instead of starting your own? If another player invites you to their island you can click here or use §e/island accept§f to join them. §e§lClick here to accept an invite! §e§l(You must be invited first)
ru: Хотите присоединится к другому игроку вместо создания своего острова? Если другой игрок пригласит вас на свой остров вы можете нажать здесь или использовать §e/island accept§f для присоединения к нему. §e§lНажмите, чтобы принять приглашение! §e§l(Вас должны сначала пригласить)

source: §a§lIsland Help
ru: §a§lПомощь

source: Need help with skyblock concepts or commands? View details about them here. §e§lClick here for help!
ru: Нужна помощь по концепции или командам? Смотрите подробнее об этом здесь. §e§lНажмите для помощи!

source: §a§lReturn Home
ru: §a§lВернуться домой

source: Return to your island's home point. You can change your home point to any location on your island using §b/island sethome §e§lClick here to return home.
ru: Возврат на свой остров, на точку дома. Вы можете изменить точку дома на любое другое место на вашем острове командой §b/island sethome §e§lНажмите для возврата домой.

source: §a§lChallenges
ru: §a§lЗадания

source: View a list of §9challenges that you can complete on your island to earn skybucks, items, perks, and titles.
ru: Список §9заданий, которые вы можете выполнять на вашем острове для получения денег, предметов, привилегий, и званий.

source: §e§lClick here to view challenges.
ru: §e§lНажмите для просмотра заданий.

source: §4§lChallenges disabled.
ru: §4§lЗадания выключены.

source: §a§lIsland Level
ru: §a§lУровень острова

source: §eCurrent Level: §a{0,number,##.#}
ru: §eТекущий уровень: §a{0,number,##.#}

source: Gain island levels by expanding your skyblock and completing certain challenges. Rarer blocks will add more to your level. §e§lClick here to refresh. §e§l(must be on island)
ru: Увеличивайте уровень за расширение вашего острова и выполнение заданий. Редкие блоки будут больше увеличивать уровень. §e§lНажмите для обновления. §e§l(надо быть на острове)

source: Island Group
ru: Группа островов

source: View the members of your island group and their permissions. If you are the island leader, you can change the member permissions. §e§lClick here to view or change.
ru: Просмотр участников вашего острова и их прав доступа. Если вы хозяин острова, то можете изменять права участникам. §e§lНажмите для просмотра или изменения.

source: Change Island Biome
ru: Изменить биом острова

source: The island biome affects things like grass color and spawning of both animals and monsters.
ru: Биом острова влияет на цвет травы и появление мобов.

source: §e§lClick here to change biomes.
ru: §e§lНажмите для изменения биома.

source: §c§lYou can't change the biome.
ru: §c§lВы не можете изменить биом.

source: §a§lIsland Lock
ru: §a§lОстров закрыт

source: §eLock Status: §aActive §fYour island is currently §clocked. §fPlayers outside of your group §fare unable to enter your island.
ru: §eСтатус блокировки: §aВключена §fВаш остров сейчас §cзакрыт. §fПосторонние игроки не §fмогут войти на остров.

source: §e§lClick here to unlock your island.
ru: §e§lНажмите, чтобы разблокировать.

source: §c§lYou can't change the lock.
ru: §c§lВы не можете изменить блокировку.

source: §eLock Status: §8Inactive §fYour island is currently §aunlocked. §fAll players are able to enter your §fisland, but only you and your group §fmembers may build there.
ru: §eСтатус блокировки: §8Отключена §fВаш остров сейчас §aоткрыт. §fВсе игроки могут войти на остров, §fно только участники могут строить.

source: §e§lClick here to lock your island.
ru: §e§lНажмите, чтобы заблокировать.

source: §a§lIsland Warp
ru: §a§lТочки перемещения

source: §eWarp Status: §aActive §fOther players may warp to your §fisland at anytime to the point §fyou set using §d/island setwarp.
ru: §eСтатус перемещения: §aВключено §fДругие игроки могут переместиться к вам §fна остров в любое время на точку, §fкоторую вы укажите командой §d/island setwarp.

source: §e§lClick here to deactivate.
ru: §e§lНажмите, чтобы выключить.

source: §c§lYou can't change the warp.
ru: §c§lВы не можете изменить статус перемещения.

source: §eWarp Status: §8Inactive §fOther players can't warp to your §fisland. Set a warp point using §d/island setwarp §fbefore activating.
ru: §eСтатус перемещения: §8Выключено §fДругие игроки не могут переместиться к вам §fна остров. Установите точку перемещения командой §d/island setwarp §fперед активацией.

source: §e§lClick here to activate.
ru: §e§lНажмите, чтобы включить.

source: §a§lIsland Log
ru: §a§lЖурнал острова

source: View a log of events from your island such as member, biome, and warp changes. §e§lClick to view the log.
ru: Просмотр журнала событий на вашем острове с момента изменения биома, точки перемещения или нового участника. §e§lНажмите для просмотра журнала.

source: §a§lChange Home Location
ru: §a§lИменить место точки дома

source: When you teleport to your island you will be taken to this location. §e§lClick here to change.
ru: Когда вы телепортируетесь на ваш остров, вы будете появляться в этом месте. §e§lНажмите для изменения.

source: §a§lChange Warp Location
ru: §a§lИзменить место точки перемещения

source: When your warp is activated, other players will be taken to this point when they teleport to your island. §e§lClick here to change.
ru: Когда перемещение включено другие игроки будут появляться в этом месте, когда телепортируются к вам на остров. §e§lНажмите, чтобы изменить.

source: Permissions
ru: Права доступа

source: Something went wrong saving the island and/or party data!
ru: Что-то пошло не так, при сохранении острова и/или данных по участникам

source: §4Player is already assigned to this island!
ru: §4Игрок уже прикреплен к острову!

source: §4You are not part of an island. Returning you the spawn area!
ru: §4Вы не участник острова. Возврат в на спавн!

source: §aTeleporting you to your island.
ru: §aТелепортация на ваш остров.

source: §aYou will be teleported in {0} seconds.
ru: §aВы будете телепортированы через {0} сек.

source: §4Unable to warp you to that player's island!
ru: §4Невозможно переместить вас на остров этого игрока!

source: §aTeleporting you to {0}'s island.
ru: §aТелепортация на остров игрока {0}.

source: §4You must be closer to your island to set your skyblock home!
ru: §4Вы должны быть ближе к острову, чтобы установить на нем точку дома!

source: §aYour skyblock home has been set to your current location.
ru: §aТочка дома на вашем острове установлена в текущем месте.

source: §4Your current location is not a safe home-location.
ru: §4Ваше текущее место не безопасно для точки дома.

source: Could not create your Island. Please contact a server moderator.
ru: Невозможно создать остров. Свяжитесь с администратором сервера.

source: §eGetting your island ready, please be patient, it can take a while.
ru: §eСоздание острова началось, подождите, это может занять некоторое время.

source: §eYay! We found a vacancy closer to spawn. §9Clearing it for you...
ru: §eО-о-о! Мы нашли вакантное место недалеко от спавна. §9Очищается для вас...

source: §7Name: §b{0}
ru: §7Название: §b{0}

source: §7Version: §b{0}
ru: §7Версия: §b{0}

source: §7Description: §b{0}
ru: §7Описание: §b{0}

source: §7Language: §b{0} ({1})
ru: §7Язык: §b{0} ({1})

source: §7Server: §e{0} {1}
ru: §7Сервер: §e{0} {1}

source: §2ENABLED
ru: §2ВКЛЮЧЕНО

source: §4DISABLED
ru: §4ОТКЛЮЧЕНО

source: §7Name: §d{0} ({1})
ru: §7Название: §d{0} ({1})

source: §7Version: §d{0}
ru: §7Версия: §d{0}

source: d
ru: д

source: h
ru: ч

source: m
ru: м

source: s
ru: с
